_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 16)                16400     
_________________________________________________________________
activation_95 (Activation)   (None, 16)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 16)                272       
_________________________________________________________________
activation_96 (Activation)   (None, 16)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 16)                272       
_________________________________________________________________
activation_97 (Activation)   (None, 16)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 6)                 102       
_________________________________________________________________
activation_98 (Activation)   (None, 6)                 0         
=================================================================
Total params: 17,046
Trainable params: 17,046
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
observation_input (InputLayer)  (None, 1, 1024)      0                                            
__________________________________________________________________________________________________
action_input (InputLayer)       (None, 6)            0                                            
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 1024)         0           observation_input[0][0]          
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 1030)         0           action_input[0][0]               
                                                                 flatten_2[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 32)           32992       concatenate_3[0][0]              
__________________________________________________________________________________________________
activation_99 (Activation)      (None, 32)           0           dense_5[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 32)           1056        activation_99[0][0]              
__________________________________________________________________________________________________
activation_100 (Activation)     (None, 32)           0           dense_6[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 32)           1056        activation_100[0][0]             
__________________________________________________________________________________________________
activation_101 (Activation)     (None, 32)           0           dense_7[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 1)            33          activation_101[0][0]             
__________________________________________________________________________________________________
activation_102 (Activation)     (None, 1)            0           dense_8[0][0]                    
==================================================================================================
Total params: 35,137
Trainable params: 35,137
Non-trainable params: 0
__________________________________________________________________________________________________
