_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
flatten_1 (Flatten)          (None, 256)               0
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792
_________________________________________________________________
activation_95 (Activation)   (None, 256)               0
_________________________________________________________________
dense_2 (Dense)              (None, 128)               32896
_________________________________________________________________
activation_96 (Activation)   (None, 128)               0
_________________________________________________________________
dense_3 (Dense)              (None, 64)                8256
_________________________________________________________________
activation_97 (Activation)   (None, 64)                0
_________________________________________________________________
dense_4 (Dense)              (None, 5)                 325
=================================================================
Total params: 107,269
Trainable params: 107,269
Non-trainable params: 0
_________________________________________________________________
